; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v5 ?v7)
             (pred_6 ?v8 ?v10)
             (pred_2 ?v5 ?v10)
             (pred_9 ?v4 ?v5 )
	     (pred_12 ?v5)
             (pred_1 ?v11)
             (pred_8 ?v8)
             (pred_10 ?v10)
             (pred_3 ?v5)
             (pred_11 ?v8)
             (pred_5 ?v5)
             (pred_7 ))



(:action op_2
:parameters (?v2 ?v12 ?v13 ?v3)
:precondition (and (pred_1 ?v2) (pred_1 ?v12) (pred_8 ?v13) (pred_10 ?v3)
          (pred_4 ?v2 ?v12) (pred_6 ?v13 ?v3)
                   (pred_2 ?v12 ?v3) (pred_12 ?v2) 
                   (pred_3 ?v12) (pred_11 ?v13))
:effect (and  (pred_5 ?v12) (not (pred_3 ?v12))))


(:action op_4
:parameters (?v2 ?v6)
:precondition (and (pred_1 ?v2) (pred_1 ?v6)
               (pred_12 ?v2) (pred_4 ?v2 ?v6) (pred_5 ?v6))
:effect (and (pred_12 ?v6) (not (pred_12 ?v2))))

(:action op_1
:parameters (?v2 ?v13)
:precondition (and (pred_1 ?v2) (pred_8 ?v13) 
                  (pred_12 ?v2) (pred_9 ?v13 ?v2) (pred_7 ))
:effect (and (pred_11 ?v13)
   (not (pred_9 ?v13 ?v2)) (not (pred_7 ))))


(:action op_5
:parameters (?v2 ?v9 ?v1)
:precondition (and (pred_1 ?v2) (pred_8 ?v9) (pred_8 ?v1)
                  (pred_12 ?v2) (pred_11 ?v1) (pred_9 ?v9 ?v2))
:effect (and (pred_11 ?v9) (pred_9 ?v1 ?v2)
        (not (pred_11 ?v1)) (not (pred_9 ?v9 ?v2))))

(:action op_3
:parameters (?v2 ?v13)
:precondition (and (pred_1 ?v2) (pred_8 ?v13) 
                  (pred_12 ?v2) (pred_11 ?v13))
:effect (and (pred_7 ) (pred_9 ?v13 ?v2) (not (pred_11 ?v13)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_21 obj_16 obj_08 obj_02 obj_19 obj_14 obj_20 obj_15 obj_05 obj_12 obj_01 obj_07 obj_06 obj_11 obj_04
    obj_09 obj_17
    obj_10 obj_13 obj_03
    )

    (:init
       (pred_7)

       (pred_1 obj_18)
       (pred_1 obj_21)
       (pred_1 obj_16)
       (pred_1 obj_08)
       (pred_1 obj_02)
       (pred_1 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_20)
       (pred_1 obj_15)
       (pred_1 obj_05)
       (pred_1 obj_12)
       (pred_1 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_06)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_17)
       (pred_8 obj_10)
       (pred_8 obj_13)
       (pred_8 obj_03)

       (pred_4 obj_18 obj_02)
       (pred_4 obj_18 obj_21)
       (pred_4 obj_21 obj_19)
       (pred_4 obj_21 obj_16)
       (pred_4 obj_21 obj_18)
       (pred_4 obj_16 obj_14)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_16 obj_21)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_02 obj_15)
       (pred_4 obj_02 obj_19)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_19 obj_14)
       (pred_4 obj_19 obj_21)
       (pred_4 obj_19 obj_02)
       (pred_4 obj_14 obj_12)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_14 obj_16)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_20 obj_01)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_15 obj_07)
       (pred_4 obj_15 obj_05)
       (pred_4 obj_15 obj_02)
       (pred_4 obj_05 obj_06)
       (pred_4 obj_05 obj_12)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_05 obj_15)
       (pred_4 obj_12 obj_11)
       (pred_4 obj_12 obj_01)
       (pred_4 obj_12 obj_14)
       (pred_4 obj_12 obj_05)
       (pred_4 obj_01 obj_04)
       (pred_4 obj_01 obj_20)
       (pred_4 obj_01 obj_12)
       (pred_4 obj_07 obj_06)
       (pred_4 obj_07 obj_15)
       (pred_4 obj_06 obj_11)
       (pred_4 obj_06 obj_05)
       (pred_4 obj_06 obj_07)
       (pred_4 obj_11 obj_04)
       (pred_4 obj_11 obj_12)
       (pred_4 obj_11 obj_06)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_04 obj_11)
       (pred_3 obj_05)
       (pred_3 obj_04)
       (pred_3 obj_07)
       (pred_2  obj_05 obj_09)
       (pred_2  obj_04 obj_17)
       (pred_2  obj_07 obj_17)
       (pred_5 obj_18)
       (pred_5 obj_21)
       (pred_5 obj_16)
       (pred_5 obj_08)
       (pred_5 obj_02)
       (pred_5 obj_19)
       (pred_5 obj_14)
       (pred_5 obj_20)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_5 obj_06)
       (pred_5 obj_11)

       (pred_6  obj_10 obj_09)
       (pred_6  obj_13 obj_17)
       (pred_6  obj_03 obj_17)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_03 obj_08)
       (pred_12 obj_01)
    )

    (:goal (and
       (pred_9 obj_03 obj_16)
    ))
(:constraints
  (always (not (pred_12 obj_20)))
)
)

; plan
1. (op_4 obj_01 obj_12)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_12)
   goals met: 0 of 1
2. (op_4 obj_12 obj_14)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_14)
   goals met: 0 of 1
3. (op_4 obj_14 obj_16)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_16)
   goals met: 0 of 1
4. (op_4 obj_16 obj_08)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_08)
   goals met: 0 of 1
5. (op_1 obj_08 obj_03)
   deleted: (pred_9 obj_03 obj_08) (pred_7)
   added: (pred_11 obj_03)
   goals met: 0 of 1
6. (op_4 obj_08 obj_16)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_16)
   goals met: 0 of 1
7. (op_3 obj_16 obj_03)
   deleted: (pred_11 obj_03)
   added: (pred_7) (pred_9 obj_03 obj_16)
   goals met: 1 of 1
